sample_app/app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["body", "a"], ["created_at", "2019-04-12 14:00:18.271249"], ["updated_at", "2019-04-12 14:00:18.271249"], ["title", "a"]]
---
  def create
    post = Post.new(post_params)
    post.save